### Indexación de dataframes

In [ ]:
import pandas as pd
import numpy as np

- Se suele importar pandas como pd

In [ ]:
dataframe = pd.DataFrame(np.arange(16).reshape(4, 4),
                         index=['f1', 'f2', 'f3', 'f4'],
                         columns=['c1','c2','c3','c4'])
dataframe

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [ ]:
# bfill
serie1.reindex(range(7), method='bfill')

0    0.0
1    0.1
2    0.2
3    0.3
4    0.4
5    NaN
6    NaN
dtype: float64

In [1]:
# Dataframe con una columna de pares y otra de impares
numeros = pd.DataFrame({'pares': np.arange(0, 10, 2),
                            'impares': np.arange(1, 10, 2)},)

NameError: name 'numeros' is not defined

Indexación mediante clave

In [ ]:
numeros.pares

0    0
1    2
2    4
3    6
4    8
Name: pares, dtype: int64

Indexación directa

In [ ]:
numeros['pares']

0    0
1    2
2    4
3    6
4    8
Name: pares, dtype: int64

In [ ]:
numeros[['pares']]

   pares
0      0
1      2
2      4
3      6
4      8

Indexación mediante método .loc[]

Con el método .loc podemos seleccionar una fila, una columna, un valor o un rango de valores usando claves

In [ ]:
dataframe.loc['f1']

c1    0
c2    1
c3    2
c4    3
Name: f1, dtype: int32

In [ ]:
dataframe.loc[:, 'c1']

f1     0
f2     4
f3     8
f4    12
Name: c1, dtype: int32

In [ ]:
dataframe.loc['f1', 'c1']

0

Con el método .iloc[] indexamos usando enteros

In [ ]:
dataframe.iloc[1]

c1    4
c2    5
c3    6
c4    7
Name: f2, dtype: int32

In [ ]:
dataframe.iloc[:, 1]

f1     1
f2     5
f3     9
f4    13
Name: c2, dtype: int32

In [ ]:
dataframe.iloc[1:3, 2:4]

    c3  c4
f2   6   7
f3  10  11

In [ ]:
numeros.pares > 2

0    False
1    False
2     True
3     True
4     True
Name: pares, dtype: bool

In [ ]:
numeros[numeros.pares>2]

   pares  impares
2      4        5
3      6        7
4      8        9

In [ ]:
numeros.iloc[1:4, :][numeros.pares>2]

C:\Users\alfon\AppData\Local\Temp\ipykernel_18056\3341242192.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  numeros.iloc[1:4, :][numeros.pares>2]

   pares  impares
2      4        5
3      6        7

### Asignación en pandas

Podemos asignar valoes a columnas, filas o celdas individuales

In [ ]:
numeros['primos'] = [1, 3, 5 ,7, 11]
numeros

   pares  impares  primos
0      0        1       1
1      2        3       3
2      4        5       5
3      6        7       7
4      8        9      11

In [ ]:
numeros.iloc[1,2]=0
numeros

   pares  impares  primos
0      0        1       1
1      2        3       0
2      4        5       5
3      6        7       7
4      8        9      11

In [ ]:
numeros[numeros.pares>2]=-1
numeros

   pares  impares  primos
0      0        1       1
1      2        3       0
2     -1       -1      -1
3     -1       -1      -1
4     -1       -1      -1

### Borrar columnas

In [ ]:
del numeros['primos']
numeros

   pares  impares
0      0        1
1      2        3
2     -1       -1
3     -1       -1
4     -1       -1

In [ ]:
numeros = numeros.iloc[:, :-1]
numeros

   pares
0      0
1      2
2     -1
3     -1
4     -1

In [ ]:
dataframe

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [ ]:
dataframe.drop('c1', axis=1)

    c2  c3  c4
f1   1   2   3
f2   5   6   7
f3   9  10  11
f4  13  14  15

In [ ]:
dataframe.drop('f1', axis=0)

    c1  c2  c3  c4
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [ ]:
dataframe

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [ ]:
dataframe.drop('c1', axis=1, inplace=True)
dataframe

    c2  c3  c4
f1   1   2   3
f2   5   6   7
f3   9  10  11
f4  13  14  15

# EJERCICIOS

Leer los datos del fichero Fullmetadata.csv y almacenarlo en un DataFrame

In [ ]:
footbal_stats = pd.read_csv('./data/Fullmetadata.csv', index_col='player_id')
footbal_stats

,player_name,games,time,goals,shots,key_passes,yellow_cards,red_cards,position,team_name
player_id,,,,,,,,,,
8865,Ollie Watkins,9,810,6,22,12,0,0,F,Aston Villa
675,Jack Grealish,9,810,5,26,26,2,0,F M,Aston Villa
592,Ross Barkley,6,454,2,17,15,0,0,M,Aston Villa
1024,Tyrone Mings,9,810,2,7,2,2,0,D,Aston Villa
7726,Ezri Konsa Ngoyo,9,810,2,7,0,0,0,D,Aston Villa
...,...,...,...,...,...,...,...,...,...,...
4267,Florian Hartherz,10,775,0,1,5,1,1,D S,Paderborn
4268,Christian Strohdiek,22,1608,0,6,3,2,0,D S,Paderborn
4311,Idir Ouali,6,296,0,4,1,1,0,M S,Paderborn
4334,Mirnes Pepic,2,20,0,0,0,0,0,S,Paderborn
4363,Thomas Bertels,1,3,0,0,0,0,0,S,Paderborn

Muestra una descripción de los datos

Muestra las 3 primeras filas

Selecciona las columnas player_names y goals

Elimina la columna games sin crear nuevo DataFrame

Selecciona los jugadores del Aston Villa

Selecciona los jugadores que hayan sido expulsados

Selecciona los jugadores que hayan visto una tarjeta amarilla pero no hayan sido expulsados